docs/posts/2015-01-20-permanent-impermanence.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Mar 16, 2026 19:44 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Permanent Impermanence</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Permanent Impermanence</h1>
<p class="subtitle" role="doc-subtitle">Jan 19, 2015 00:00</p>
</header><blockquote>
<p>
As I wrote recently, everything in existence is permanently impermanent. 
</p>
</blockquote>

<p class="source">
<a href="http://minimalmac.com/post/14973202531/the-only-standard-is-impermanence%20Minimal%20Mac" class="source">Patrick Rhone</a>
</p>

<p>
I detect shades of Heraclitus here.
</p>

<p>
Question: is this a paradox? Answer: probably not, unless Rhone is committed to the belief that nothing at all, even impermanence, is permanent. It is a good opportunity to do some analytic philosophy, though. 
</p>

<p>
What is permanence? Is it a real property, or is it a derivative analyzed in terms of the real properties of an object? What&rsquo;s the status of self-predication; must permanence itself be permanent? If there is nothing in existence that is permanent, then does that mean that abstract objects (numbers, sets, etc.) do not exist? Does that commit us to something like subsistence for abstract entities? Does permanence mean simply that an object always exists, or does it also mean that an object never changes? If the first, then most, if not all, theists would reject the claim that nothing in existence is permanent. If the second, then we would have to at least reject the doctrine of the immutability of God.
</p>

<p>
Here&rsquo;s my first attempt to symbolize permanence, attempting to say that that an object is permanent just in case for any property that the object has any time, it has that property at all times.
</p>



<p>

<math xmlns="http://www.w3.org/1998/Math/MathML" id="S0.Ex1.m1.1" class="ltx_math_unparsed" alttext="\forall x\{\textrm{Px}\leftrightarrow[\forall\textrm{F}\forall t_{1}(\textrm{F%&#10;}xt_{1}\rightarrow\forall t_{2}\textrm{F}xt_{2})]\}" display="block">
  <semantics id="S0.Ex1.m1.1a">
    <mrow id="S0.Ex1.m1.1b">
      <mo rspace="0.167em" id="S0.Ex1.m1.1.1">∀</mo>
      <mi id="S0.Ex1.m1.1.2">x</mi>
      <mrow id="S0.Ex1.m1.1.3">
        <mo stretchy="false" id="S0.Ex1.m1.1.3.1">{</mo>
        <mtext id="S0.Ex1.m1.1.3.2">Px</mtext>
        <mo stretchy="false" id="S0.Ex1.m1.1.3.3">↔</mo>
        <mrow id="S0.Ex1.m1.1.3.4">
          <mo stretchy="false" id="S0.Ex1.m1.1.3.4.1">[</mo>
          <mo rspace="0.167em" id="S0.Ex1.m1.1.3.4.2">∀</mo>
          <mtext id="S0.Ex1.m1.1.3.4.3">F</mtext>
          <mo lspace="0.167em" rspace="0.167em" id="S0.Ex1.m1.1.3.4.4">∀</mo>
          <msub id="S0.Ex1.m1.1.3.4.5">
            <mi id="S0.Ex1.m1.1.3.4.5.2">t</mi>
            <mn id="S0.Ex1.m1.1.3.4.5.3">1</mn>
          </msub>
          <mrow id="S0.Ex1.m1.1.3.4.6">
            <mo stretchy="false" id="S0.Ex1.m1.1.3.4.6.1">(</mo>
            <mtext id="S0.Ex1.m1.1.3.4.6.2">F</mtext>
            <mi id="S0.Ex1.m1.1.3.4.6.3">x</mi>
            <msub id="S0.Ex1.m1.1.3.4.6.4">
              <mi id="S0.Ex1.m1.1.3.4.6.4.2">t</mi>
              <mn id="S0.Ex1.m1.1.3.4.6.4.3">1</mn>
            </msub>
            <mo stretchy="false" id="S0.Ex1.m1.1.3.4.6.5">→</mo>
            <mo rspace="0.167em" id="S0.Ex1.m1.1.3.4.6.6">∀</mo>
            <msub id="S0.Ex1.m1.1.3.4.6.7">
              <mi id="S0.Ex1.m1.1.3.4.6.7.2">t</mi>
              <mn id="S0.Ex1.m1.1.3.4.6.7.3">2</mn>
            </msub>
            <mtext id="S0.Ex1.m1.1.3.4.6.8">F</mtext>
            <mi id="S0.Ex1.m1.1.3.4.6.9">x</mi>
            <msub id="S0.Ex1.m1.1.3.4.6.10">
              <mi id="S0.Ex1.m1.1.3.4.6.10.2">t</mi>
              <mn id="S0.Ex1.m1.1.3.4.6.10.3">2</mn>
            </msub>
            <mo stretchy="false" id="S0.Ex1.m1.1.3.4.6.11">)</mo>
          </mrow>
          <mo stretchy="false" id="S0.Ex1.m1.1.3.4.7">]</mo>
        </mrow>
        <mo stretchy="false" id="S0.Ex1.m1.1.3.5">}</mo>
      </mrow>
    </mrow>
    <annotation encoding="application/x-tex" id="S0.Ex1.m1.1c">\forall x\{\textrm{Px}\leftrightarrow[\forall\textrm{F}\forall t_{1}(\textrm{F%
}xt_{1}\rightarrow\forall t_{2}\textrm{F}xt_{2})]\}</annotation>
  </semantics>
</math>

</p>


<p>
This is why people hate analytic philosophers.
</p>



<div class="tagline" id="org4233799">
<p>
Tagged: <a href="../tags/philosophy.html">Philosophy</a> <a href="../tags/quotes.html">Quotes</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Mar 16, 2026 19:44.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.11).
</div>
</footer>
</body>
</html>
